Feature('과제 테스트');

Scenario('메뉴판 필터링', ({ I }) => {
  I.amOnPage('/');

  // TODO: E2E 테스트를 작성해주세요.
  I.see('푸드코트 키오스크');

  // 중식 필터링
  I.click('중식');
  I.see('짜장면(8,000원)');
  I.see('짬뽕(8,000원)');
  I.see('차돌짬뽕(9,000원)');
  I.see('탕수육(14,000원)');
  I.dontSee('김밥(3,500원)');

  // 한식 필터링
  I.click('한식');
  I.see('김밥(3,500원)');
  I.see('훈제오리김밥(5,500원)');
  I.dontSee('기본카레(9,000원)');

  // 일식 필터링
  I.click('일식');
  I.see('닭가슴살카레(13,000원)');
  I.see('소시지카레(13,000원)');
  I.dontSee('탕수육(14,000원)');

  // 검색 필터링
  I.click('전체');
  I.fillField('검색', '메리');
  I.see('참치김밥(4,500원)');
  I.see('훈제오리김밥(5,500원)');
  I.dontSee('탕수육(14,000원)');
});

Scenario('음식 주문하기', ({ I }) => {
  I.amOnPage('/');

  // TODO: E2E 테스트를 작성해주세요.
  I.click({ name: '#닭가슴살카레' });
  I.click({ name: '#제육김밥' });

  I.click({ name: 'order' });

  I.see('총 가격: 18,000원');
  I.see('영수증');

  I.wait(5);
  I.dontSee('주문번호');
});
